Documents/АудиторскоеЗаключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АудиторскоеЗаключение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетностиПодлежащиеАудиторскойПроверке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияМненияОДостоверностиОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииМненийОДостоверностиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписанияОтчетности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскрытиеОтчетностиВИномМесте</Name>
					<Comment>Адрес в сети интернет, либо печатное издание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическоеРаскрытиеИнформации</Name>
					<Comment>Да - фактическое, Нет - плановое</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницаРаскрытияАудиторскогоЗаключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписанты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОРНЗАудитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвалификационногоАттестатаАудитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОРНЗРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвалификационногоАттестатаРуководителяАудиторскойОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьУполномоченногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доверенности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУполномочивающегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУполномочивающегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействияПолномочий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПолномочий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОСобытии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УсловияДоговоровОказанияАудиторскихУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОказанияАудиторскихУслуг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГодоваяБухгалтерскаяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПромежуточнаяБухгалтерскаяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГодоваяКонсолидированнаяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПромежуточнаяКонсолидированнаяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГодоваяФинансоваяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПромежуточнаяФинансоваяОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БухгалтерскаяФинансоваяПоФормированиюИИнвестированиюПН</Name>
					<Comment>Бухгалтерская (финансовая) отчетность по формированию и инвестированию ПН, а также финансирования выплат за счет средств ПН</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтчетностьВОтношенииИмуществаПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПредоставленияУслуг</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПредоставленияУслуг</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетностиПодлежащиеАудиторскойПроверке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОтчетностиПодлежащиеАудиторскойПроверке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОтчетностиПодлежащиеАудиторскойПроверке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГодоваяБухгалтерская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяБухгалтерскаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяКонсолидированнаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяКонсолидированнаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьВОтношенииИмуществаПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяФинансоваяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточнаяФинансоваяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяФинансоваяПоФормированиюИИнвестированиюПН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АудиторскоеЗаключение/Ext/ObjectModule.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	  
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Если Не (ЭтотОбъект.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяКонсолидированнаяОтчетность
	   И Год(ЭтотОбъект.КонецПериодаОтчетности) >= 2020)  Тогда
		НепроверяемыеРеквизиты.Добавить("СоставОтчетности");
		НепроверяемыеРеквизиты.Добавить("ДатаПодписанияОтчетности");
	КонецЕсли;	
	
	Если Документы.АудиторскоеЗаключение.ЭтоСтандартныйПериодОтчетности(ЭтотОбъект.НачалоПериодаОтчетности, 
																		ЭтотОбъект.КонецПериодаОтчетности) Тогда
		
		НепроверяемыеРеквизиты.Добавить("ИнформацияОСобытии");
		
	КонецЕсли;	
	
	Если ЭтотОбъект.КатегорияМненияОДостоверностиОтчетности = Перечисления.КатегорииМненийОДостоверностиОтчетности.НемодифицированноеАудиторскоеЗаключение Тогда
		
		НепроверяемыеРеквизиты.Добавить("Примечание");
		
	КонецЕсли;	
	
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов)
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
		
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Договор.ВидДоговора = Перечисления.ВидыДоговоров.ДополнительноеСоглашение Тогда
		ДоговорОказанияАудиторскихУслуг = ЭтотОбъект.Договор.Основание;
	Иначе
		ДоговорОказанияАудиторскихУслуг = ЭтотОбъект.Договор;
	КонецЕсли;
	
	Если ТипЗнч(ДоговорОказанияАудиторскихУслуг) <> Тип("СправочникСсылка.Договоры") 
	 ИЛИ ДоговорОказанияАудиторскихУслуг.ВидДоговора <> Перечисления.ВидыДоговоров.ОказанияАудиторскихУслуг Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В поле договор должен быть выбран договор вида %1 или доп.соглашение к такому договору", Перечисления.ВидыДоговоров.ОказанияАудиторскихУслуг), ЭтотОбъект, "Договор",, Отказ);
		Возврат;
	КонецЕсли;
	
	УсловияДоговоровОказанияАудиторскихУслуг = РегистрыСведений.УсловияДоговоровОказанияАудиторскихУслуг.СрезПоследних(ЭтотОбъект.Дата, Новый Структура("Договор", ДоговорОказанияАудиторскихУслуг));
	Если УсловияДоговоровОказанияАудиторскихУслуг.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для договора " + ДоговорОказанияАудиторскихУслуг + " не заданы условия договоров оказания аудиторских услуг на дату " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yy"),,,, Отказ);
		
	ИначеЕсли ЭтотОбъект.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяБухгалтерская
		Или ЭтотОбъект.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ПромежуточнаяБухгалтерскаяОтчетность
		Или ЭтотОбъект.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ГодоваяКонсолидированнаяОтчетность
		Или ЭтотОбъект.ВидОтчетности = Перечисления.ВидыОтчетностиПодлежащиеАудиторскойПроверке.ПромежуточнаяКонсолидированнаяОтчетность Тогда
		
		ПроверитьВидОтчетности(ДоговорОказанияАудиторскихУслуг, Отказ);	
	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВидОтчетности(ДоговорОказанияАудиторскихУслуг, Отказ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",          ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Договор",       ДоговорОказанияАудиторскихУслуг);
	Запрос.УстановитьПараметр("Организация",   ЭтотОбъект.Организация); 
	Запрос.УстановитьПараметр("ВидОтчетности", ЭтотОбъект.ВидОтчетности); 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(УсловияДоговоровОказанияАудиторскихУслуг.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.УсловияДоговоровОказанияАудиторскихУслуг КАК УсловияДоговоровОказанияАудиторскихУслуг
		|		ГДЕ
		|			УсловияДоговоровОказанияАудиторскихУслуг.Период <= &Дата
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Организация = &Организация
		|			И УсловияДоговоровОказанияАудиторскихУслуг.Договор = &Договор) КАК ПериодУсловийДоговора
		|		ПО УсловияДоговоровОказанияАудиторскихУслуг.Период = ПериодУсловийДоговора.Период
		|			И (УсловияДоговоровОказанияАудиторскихУслуг.Организация = &Организация)
		|			И (УсловияДоговоровОказанияАудиторскихУслуг.Договор = &Договор)
		|ГДЕ
		|	УсловияДоговоровОказанияАудиторскихУслуг.ВидОтчетности = &ВидОтчетности";
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		ТекстСообщения = СтрШаблон("Для договора ""%1"" в условиях договоров оказания аудиторских услуг не выбран вид отчётности ""%2""",
									ДоговорОказанияАудиторскихУслуг,
									ЭтотОбъект.ВидОтчетности);
									
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,	, , Отказ);
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти
